# переменные выделяются '$' с обеих сторон
# сокращения выделяются '@' с обеих сторон
# функции выделяются '#' с обеих сторон
# врехний индекс запрещен
# вложенный нижний индекс запрещен
import os
from numba import jit
import numpy as np
import config
import matplotlib.pyplot as plt
from myo_supportfs import read_diet, make_Fcarb, make_Fprot, make_Ffat
# from Plotting.myplt import plot_vec

system_functions = {
    r'F_{carb}':    {'py_name': 'F_carb',       'module': 'sysv1_de_config'},
    r'F_{fat}':     {'py_name': 'F_fat',        'module': 'sysv1_de_config'},
    r'F_{prot}':    {'py_name': 'F_prot',       'module': 'sysv1_de_config'},
    r'f':           {'py_name': 'sigmoid',      'module': 'sysv1_de_config'}
}


write_generated_code_to = os.path.join(config.project_path, 'SystemV1')
write_latex_view_of_system_to = os.path.join(config.project_path, 'SystemV1')
name_of_generated_pyhton_file = 'myocyte_gen_des.py'

diet_table_path = os.path.join(config.problem_folder, 'diet_Mikhail.xlsx')
diet_data = read_diet(diet_table_path)
F_carb = make_Fcarb(diet_data)
F_prot = make_Fprot(diet_data)
F_fat  = make_Ffat(diet_data)



@jit(nopython=True, cache=True)
def KB_plasma(x):
    return 0.0

@jit(nopython=True, cache=True)
def SP_myo(x):
    return 0.0

@jit(nopython=True, cache=True)
def sigmoid(x, alpha, beta, gamma, delta):
    # limitations
    # beta > alpha
    # delta >= gamma
    # if delta <= gamma:
    #     print('delta <= gamma in sigmoid')
    #     raise SystemExit
    if x < alpha:
        return gamma
    if x > beta:
        return delta
    if alpha <= x <= beta:
        return (delta-gamma)/(beta-alpha)*x+(gamma*beta-delta*alpha)/(beta-alpha)


tau = 0.01  # [min]
t0 = 0.0 # [min]
tend = 1440.0*2 # [min]
# tend = 50.0 # [min]

# t = np.linspace(start=t0, stop=tend, num=int((tend-t0)/tau)+1)
# ycarb=[F_carb(t[i]) for i in range(len(t))]
# plot_vec(t,ycarb,title = "carbs [g]",block=False)
# yfat=[F_fat(t[i]) for i in range(len(t))]
# plot_vec(t,yfat,title = "fats [g]",block=False)
# yprot=[F_prot(t[i]) for i in range(len(t))]
# plot_vec(t,yprot,title = "prots [g]",block=False)
# plt.show()

# параметры alpha beta gamma delta должны быть того же порядка, как и аргументы для функции f
params_values = {

    ### INS

    '$CL_{INS}$':           0.1,

    r'$\alpha$':            2.0,
    #    r'$\alpha_{a2}$':       1.0,
    #    r'$\alpha_{a4}$':       1.0,
    #    r'$\alpha_{a5}$':       1.0,
    #    r'$\alpha_{a7}$':       1.0,
    #    r'$\alpha_{a10}$':      1.0,

    #    r'$\alpha_{m1}$':       1.0,
    #    r'$\alpha_{m3}$':       1.0,
    #    r'$\alpha_{m6}$':       1.0,
    #    r'$\alpha_{m8}$':       1.0,
    #    r'$\alpha_{m10}$':      1.0,

    #    r'$\alpha_{h3}$':       1.0,
    #    r'$\alpha_{h6}$':       1.0,
    #    r'$\alpha_{h8}$':       1.0,
    #    r'$\alpha_{h10}$':      1.0,
    #    r'$\alpha_{h12}$':      1.0,
    #    r'$\alpha_{h17}$':      1.0,
    #    r'$\alpha_{h29}$':      1.0,
    #    r'$\alpha_{h30}$':      1.0,

    ###

    r'$\beta$':             0.02,
    #    r'$\beta_{a2}$':        2.0,
    #    r'$\beta_{a4}$':        2.0,
    #    r'$\beta_{a5}$':        2.0,
    #    r'$\beta_{a7}$':        2.0,
    #    r'$\beta_{a10}$':       2.0,

    #    r'$\beta_{m1}$':        2.0,
    #    r'$\beta_{m3}$':        2.0,
    #    r'$\beta_{m6}$':        2.0,
    #    r'$\beta_{m8}$':        2.0,
    #    r'$\beta_{m10}$':       2.0,

    #    r'$\beta_{h3}$':        2.0,
    #    r'$\beta_{h6}$':        2.0,
    #    r'$\beta_{h8}$':        2.0,
    #    r'$\beta_{h10}$':       2.0,
    #    r'$\beta_{h12}$':       2.0,
    #    r'$\beta_{h17}$':       2.0,
    #    r'$\beta_{h29}$':       2.0,
    #    r'$\beta_{h30}$':       2.0,

    ###

    #    r'$\delta_{a2}$':       2.0,
    #    r'$\delta_{a4}$':       2.0,
    #    r'$\delta_{a5}$':       2.0,
    #    r'$\delta_{a7}$':       2.0,
    #    r'$\delta_{a10}$':      2.0,

    #    r'$\delta_{m1}$':       2.0,
    #    r'$\delta_{m3}$':       2.0,
    #    r'$\delta_{m6}$':       2.0,
    #    r'$\delta_{m8}$':       2.0,
    #    r'$\delta_{m10}$':      2.0,

    #    r'$\delta_{h3}$':       2.0,
    #    r'$\delta_{h6}$':       2.0,
    #    r'$\delta_{h8}$':       2.0,
    #    r'$\delta_{h10}$':      2.0,
    #    r'$\delta_{h12}$':      2.0,
    #    r'$\delta_{h17}$':      2.0,
    #    r'$\delta_{h29}$':      2.0,
    #    r'$\delta_{h30}$':      2.0,

    ###

    r'$\gamma$':            1.0,
    #    r'$\gamma_{a4}$':       1.0,
    #    r'$\gamma_{a5}$':       1.0,
    #    r'$\gamma_{a7}$':       1.0,
    #    r'$\gamma_{a10}$':      1.0,

    #    r'$\gamma_{m1}$':       1.0,
    #    r'$\gamma_{m3}$':       1.0,
    #    r'$\gamma_{m6}$':       1.0,
    #    r'$\gamma_{m8}$':       1.0,
    #    r'$\gamma_{m10}$':      1.0,

    #    r'$\gamma_{h3}$':       1.0,
    #    r'$\gamma_{h6}$':       1.0,
    #    r'$\gamma_{h8}$':       1.0,
    #    r'$\gamma_{h10}$':      1.0,
    #    r'$\gamma_{h12}$':      1.0,
    #    r'$\gamma_{h17}$':      1.0,
    #    r'$\gamma_{h29}$':      1.0,
    #    r'$\gamma_{h30}$':      1.0,

    ### GLN

    '$CL_{GLN}$':           0.1,
    #    r'$\lambda_{a3}$':      1.0,
    #    r'$\lambda_{a9}$':      1.0,
    #    r'$\lambda_{a11}$':     1.0,
    #    r'$\lambda_{m7}$':      1.0,
    #    r'$\lambda_{h2}$':      1.0,
    #    r'$\lambda_{h11}$':     1.0,
    #    r'$\lambda_{h15}$':     1.0,
    #    r'$\lambda_{h25}$':     1.0,

    ### CAM

    '$CL_{CAM}$':           0.1,
    #    r'$\sigma_{a3}$':       1.0,
    #    r'$\sigma_{m7}$':       1.0,
    #    r'$\sigma_{h11}$':      1.0,

    ###

    #    r'$\tau_{carb}$':     60.0,     # [min]
    #    r'$\tau_{fat}$':      110.0,    # [min]
    #    r'$\tau_{prot}$':     90.0,     # [min}

    '$a_{carb}$':         1.0,
    '$a_{fat}$':          1.0,
    '$a_{prot}$':         1.0,

   # номера коэффициентов

    '$a_{1}$':            10.0**(-5),
    '$a_{2}$':            10.0**(-5),
    '$a_{3}$':            10.0**(-5),
    '$a_{4}$':            10.0**(-5),
    '$a_{5}$':            10.0**(-5),
    '$a_{6}$':            10.0**(-5),
    '$a_{7}$':            10.0**(-5),
    '$a_{8}$':            10.0**(-5),
    '$a_{9}$':            10.0**(-5),
    '$a_{10}$':            10.0**(-5),
    '$a_{11}$':            10.0**(-5),
    '$a_{12}$':            10.0**(-5),
    '$a_{13}$':            10.0**(-5),
    '$a_{14}$':            10.0**(-5),
    '$a_{15}$':            10.0**(-5),
    '$a_{16}$':            10.0**(-5),
    '$a_{17}$':            10.0**(-5),
    '$a_{18}$':            10.0**(-5),
    '$a_{19}$':            10.0**(-5),


    '$m_{1}$':            10.0**(-5),
    '$m_{2}$':            10.0**(-5),
    '$m_{3}$':            10.0**(-5),
    '$m_{4}$':            10.0**(-5),
    '$m_{5}$':            10.0**(-5),
    '$m_{6}$':            10.0**(-5),
    '$m_{7}$':            10.0**(-5),
    '$m_{8}$':            10.0**(-5),
    '$m_{9}$':            10.0**(-5),
    '$m_{10}$':           10.0**(-5),
    '$m_{11}$':           10.0**(-5),
    '$m_{12}$':           10.0**(-5),  # *[Carnitin]
    '$m_{13}$':           10.0**(-5),
    '$m_{14}$':           10.0**(-5),
    '$m_{15}$':           10.0**(-5),
    '$m_{16}$':           10.0**(-5), # *[Creatin]
    '$m_{17}$':           10.0**(-5),
    '$m_{18}$':           10.0**(-5),
    '$m_{19}$':           10.0**(-5),
    '$m_{20}$':           10.0**(-5),
    '$m_{21}$':           10.0**(-5),

    '$h_{1}$':            10.0**(-5),
    '$h_{2}$':            10.0**(-5),
    '$h_{3}$':            10.0**(-5),
    '$h_{4}$':            10.0**(-5),
    '$h_{5}$':            10.0**(-5),
    '$h_{6}$':            10.0**(-5),
    '$h_{7}$':            10.0**(-5),
    '$h_{8}$':            10.0**(-5),
    '$h_{9}$':            10.0**(-5),
    '$h_{10}$':            10.0**(-5),
    '$h_{11}$':            10.0**(-5),
    '$h_{12}$':            10.0**(-5),
    '$h_{13}$':            10.0**(-5),
    '$h_{14}$':            10.0**(-5),
    '$h_{15}$':            10.0**(-5),
    '$h_{16}$':            10.0**(-5),
    '$h_{17}$':            10.0**(-5),
    '$h_{18}$':            10.0**(-5),
    '$h_{19}$':            10.0**(-5),
    '$h_{20}$':            10.0**(-5),
    '$h_{21}$':            10.0**(-5),
    '$h_{22}$':            10.0**(-5),
    '$h_{23}$':            10.0**(-5),
    '$h_{24}$':            10.0**(-5),
    '$h_{25}$':            10.0**(-5),
    '$h_{26}$':            10.0**(-5),
    '$h_{27}$':            10.0**(-5),
    '$h_{28}$':            10.0**(-5),
    '$h_{29}$':            10.0**(-5),
}
# print(len(params_values.keys()))
# raise SystemExit
# моделирование инсулина #doi: 10.1016/S1674-8301(10)60048-6
# некоторые единицы https://unitslab.com/ru/node/40 с базой

start_point = {
    r'D_{carb}':                 1.0,
    r'D_{fat}':                  1.0,
    r'D_{prot}':                 1.0,
    r'J_{carb}':                 1.0,
    r'J_{fat}':                  1.0, # mmol/L
    r'J_{prot}':                 1.0,
    r'[Glu]_{ef}':          4.5,         # mmol/l (средний референс для здоровых людей)
    r'[AA]_{ef}':           4.0,         # mmol/l
    r'[Glycerol]_{ef}':     0.2,         # mmol/l
    r'[FFA]_{ef}':          6.0,         # mmol/l
    r'[Lac]_{m}':            0.0,        # mmol/l
    r'[KB]_{ef}':            0.01,       # mmol/l
    r'[Cholestrol]_{pl}':    4.5,        # mmol/l (средний референс для здоровых людей)
    r'[Urea]_{ef}':          5.0,        # mmol/l (средний референс для здоровых людей)
    r'[TG]_{pl]':            1.5,        # mmol/l (средний референс для здоровых людей)
    r'[G6]_{a}':             1.0,        # mmol/l
    r'[G3]_{a}':             1.0,
    r'[Pyr]_{a}':            1.0,
    r'[Ac-CoA]_{a}':         1.0,
    r'[FA-CoA]_{a}':         1.0,
    r'[Cit]_{a}':            1.0,
    r'[OAA]_{a}':            1.0,
    r'[AA]_{a}':             1.0,
    r'[NADPH]_{a}':          1.0,
    r'[TG]_{a}':             10.0,        # = масса жира из биоимпеданса (13 кг)
    r'[GG]_{m}':             10.0,        # 14г/кг мышечной массы. на 21 кг - примерно 300 г
    r'[G6]_{m}':             1.0,
    r'[G3]_{m}':             1.0,
    r'[Pyr]_{m}':            1.0,
    r'[Ac-CoA]_{m}':         1.0,
    r'[FA-CoA]_{m}':         1.0,
    r'[Cit]_{m}':            1.0,
    r'[OAA]_{m}':            1.0,
    r'[H-cyt]_{m}':          1.0,
    r'[H-mit]_{m}':          1.0,
    r'[AA]_{m}':             1.0,
    r'[Muscle]_{m}':         10.0,        # = сухой белок мышц = 30% массы мышц (у меня 21кг * 0,3 = 6,3 кг)
    r'[CO2]_{m}':            0.0,
    r'[H20]_{m}':            0.0,
    r'[ATP-cyt]_{m}':        0.0, # Anaerob
    r'[ATP-mit]_{m}':        0.0, # Aerob
    r'[GG]_{h}':             1.0,        # максимум = 100 г
    r'[G6]_{h}':             1.0,
    r'[G3]_{h}':             1.0,
    r'[Pyr]_{h}':            1.0,
    r'[Ac-CoA]_{h}':         1.0,
    r'[FA-CoA]_{h}':         1.0,
    r'[MVA]_{h}':            1.0,
    r'[Cit]_{h}':            1.0,
    r'[OAA]_{h}':            1.0,
    r'[NADPH]_{h}':          1.0,
    r'[AA]_{h}':             1.0,
    r'[TG]_{h}':             1.0,        # максимум = 60 г (жирность печени - 4 г жира/100 г)
}
                    # start_point = {
                    #     'D_{carb}':                 0.0,
                    #     'D_{fat}':                  0.0,
                    #     'D_{prot}':                 0.0,
                    #     'J_{carb}':                 0.0,
                    #     'J_{fat}':                  0.0, # mmol/L
                    #     'J_{prot}':                 0.0,
                    #     '[AA-food]':                0.0,
                    #     '[AA]_{myo}':               100*(10**(-6)),# мкмоль/л
                    #     '[ATP-c]_{myo}':            2*(10**(-3)), # 2 mmol/L
                    #     '[ATP-m]_{myo}':            2*(10**(-3)), # 2 mmol/L
                    #     '[Ac-CoA]_{myo}':           0.0, # ng/uL
                    #     '[CO_2]_{myo}':             26*(10**(-3)), # 23-29 mmol/L
                    #     '[Cytr]_{myo}':             0.0, # 75nm # https://doi.org/10.1074/jbc.274.23.16010
                    #     '[FA-CoA]_{myo}':           0.0,
                    #     '[FFA]_{myo}':              0.0,
                    #     '[FFA^{loc}_{pl}]_{myo}':   0.0,
                    #     '[G3P]_{myo}':              0.0,
                    #     '[G6P]_{myo}':              0.0,
                    #     '[GG]_{myo}':               0.5*(10**(-6)), #  8-61 МЕ/л # GGT- 33-48 IU/L 0.5 мкимоль/(с*л)
                    #     '[Gluc-plasma]':            4.99*(10**(-3)), # mmol/L # КЛИНИЧЕСКОЕ ЗНАЧЕНИЕ ПОКАЗАТЕЛЕЙ УГЛЕВОДНОГО ОБМЕНА.doc
                    #     '[Gluc]_{myo}':             3.9*(10**(-3)),  # 3.9(1.03) mmol/L #  DOI: 10.1016/j.ejogrb.2005.08.028 # 3,33—5,55 ммоль/л в крови
                    #     '[Gly3P]_{myo}':            0.0,
                    #     '[INS]':                    138*(10**(-12)), # 138 pmol/L
                    #     '[LD]_{myo}':               0.0,
                    #     '[Lac]_{myo}':              0.0,
                    #     '[OAA]_{myo}':              100*(10**(-6)), # мкмоль/?
                    #     '[Pyr]_{myo}':              0.0,
                    #     '[TAG-plasma]':             0.0,
                    #     '[TAG]_{myo}':              0.0,
                    #     '[[H]f-m]_{myo}':           8*(10**(-3)), # 8 млмоль/?
                    #     '[[H]n-c]_{myo}':           8*(10**(-3)), # 8 млмоль/?
                    #     '[[H]nf-m]_{myo}':          8*(10**(-3)), # 8 млмоль/?
                    #     '[muscle]_{myo}':           0.0
                    # }


aliases_ = {

    # new aliases for Neo_Chart - сокращения

    # 0. Hormone functions (INS GLN CAM)

    # INS

    '@f([INS]_{j0})@': r'1', #
    '@f([INS]_{a2})@': r'1', # r'#f([INS],$\alpha_{a2}$,$\beta_{a2}$,$\gamma_{a2}$,$\delta_{a2}$)#',
    '@f([INS]_{a4})@': r'1', # r'#f([INS],$\alpha_{a4}$,$\beta_{a4}$,$\gamma_{a4}$,$\delta_{a4}$)#',
    '@f([INS]_{a5})@': r'1', # r'#f([INS],$\alpha_{a5}$,$\beta_{a5}$,$\gamma_{a5}$,$\delta_{a5}$)#',
    '@f([INS]_{a7})@': r'1', # r'#f([INS],$\alpha_{a7}$,$\beta_{a7}$,$\gamma_{a7}$,$\delta_{a7}$)#',
    '@f([INS]_{a10})@': r'1', # r'#f([INS],$\alpha_{a10}$,$\beta_{a10}$,$\gamma_{a10}$,$\delta_{a10}$)#',
    '@f([INS]_{a12})@': r'1', #
    '@f([INS]_{a13})@': r'1', #
    '@f([INS]_{a14})@': r'1', #
    '@f([INS]_{m1})@': r'1', # r'#f([INS],$\alpha_{m1}$,$\beta_{m1}$,$\gamma_{m1}$,$\delta_{m1}$)#',
    '@f([INS]_{m7})@': r'1', # r'#f([INS],$\alpha_{m7}$,$\beta_{m7}$,$\gamma_{m7}$,$\delta_{m7}$)#',
    '@f([INS]_{m9})@': r'1', # r'#f([INS],$\alpha_{m9}$,$\beta_{m9}$,$\gamma_{m9}$,$\delta_{m9}$)#',
    '@f([INS]_{m11})@': r'1', # r'#f([INS],$\alpha_{m11}$,$\beta_{m11}$,$\gamma_{m11}$,$\delta_{m11}$)#',
    '@f([INS]_{h3})@': r'1', # r'#f([INS],$\alpha_{h3}$,$\beta_{h3}$,$\gamma_{h3}$,$\delta_{h3}$)#',
    '@f([INS]_{h6})@': r'1', # чем меньше АУК инсулина за последние 3 часа, тем выше скорость H6
    '@f([INS]_{h7})@': r'1', # r'#f([INS],$\alpha_{h7}$,$\beta_{h7}$,$\gamma_{h7}$,$\delta_{h8}$)#',
    '@f([INS]_{h10})@': r'1', # r'#f([INS],$\alpha_{h10}$,$\beta_{h10}$,$\gamma_{h10}$,$\delta_{h10}$)#',
    '@f([INS]_{h12})@': r'1', # r'#f([INS],$\alpha_{h12}$,$\beta_{h12}$,$\gamma_{h12}$,$\delta_{h12}$)#',
    '@f([INS]_{h16})@': r'1', # r'#f([INS],$\alpha_{h167}$,$\beta_{h16}$,$\gamma_{h16}$,$\delta_{h16}$)#',
    '@f([INS]_{h19})@': r'1', #
    '@f([INS]_{h24})@': r'1', # r'#f([INS],$\alpha_{h24}$,$\beta_{h24}$,$\gamma_{h24}$,$\delta_{h24}$)#',
    '@f([INS]_{h26})@': r'1', # r'#f([INS],$\alpha_{h26}$,$\beta_{h26}$,$\gamma_{h26}$,$\delta_{h26}$)#',
    # GLN
    '@f([GLN]_{a3})@': r'1', #r'#f([G6]_{ef},$\lambda_{a3}$)#',
    '@f([GLN]_{a9})@': r'1', #r'#f([G6]_{ef},$\lambda_{a9}$)#',
    '@f([GLN]_{a11})@': r'1', #r'#f([G6]_{ef},$\lambda_{a11}$)#',
    '@f([GLN]_{m8})@': r'1', #r'#f([G6]_{ef},$\lambda_{m8}$)#',
    '@f([GLN]_{h2})@': r'1', #r'#f([G6]_{ef},$\lambda_{h2}$)#',
    '@f([GLN]_{h11})@': r'1', #r'#f([G6]_{ef},$\lambda_{h11}$)#',
    '@f([GLN]_{h13})@': r'1', #r'#f([G6]_{ef},$\lambda_{h13}$)#',
    '@f([GLN]_{h23})@': r'1',  # r'#f([G6]_{ef},$\lambda_{h23}$)#',
    '@f([GLN]_{h25})@': r'1', #r'#f([G6]_{ef},$\lambda_{h25}$)#',

    # CAM

    '@f([CAM]_{a3})@': r'1', #r'#f([Heart Rate],$\sigma_{a3}$)#',
    '@f([CAM]_{a11})@': r'1',  # r'#f([Heart Rate],$\sigma_{a11}$)#',
    '@f([CAM]_{m8})@': r'1', #r'#f([Heart Rate],$\sigma_{m8}$)#',
    '@f([CAM]_{h11})@': r'1', #r'#f([Heart Rate],$\sigma_{h11}$)#',
    '@f([CAM]_{h25})@': r'1', #r'#f([Heart Rate],$\sigma_{h25}$)#',

    # 1. Extracellular fluid

    '@J_0@': r'$j_{0}$ * [TG]_{pl} * #f([INS]_{j0})#',
    '@J_1@': r'$j_{1}$ * [Glu]_{ef}',
    '@J_2@': r'$j_{2}$ * [KB]_{ef}',
    '@J_3@': r'$j_{3}$ * [FFA]_{ef}',
    '@J_4@': r'$j_{4}$ * [AA]_{ef}',

    # здесь должно быть ещё пять процессов:
    # три - входы БЖУ;

      #  '@J_{carb}@':
      #  '@J_{prot}@':
      #  '@J_{fat}@':

    # Ниже в коде есть такая часть:

        # Вход нутриентов (часть старого кода)

        #    'D_{carb}': r'($a_{carb}$ * #F_{carb}(t)# - D_{carb}) / $\tau_{carb}$',
        #    'J_{carb}': r'(D_{carb} - J_{carb}) / $\tau_{carb}$',
        #    'D_{fat}': r'($a_{fat}$ * #F_{fat}(t)# - D_{fat}) / $\tau_{fat}$',
        #    'J_{fat}': r'(D_{fat} - J_{fat}) / $\tau_{fat}$',
        #    'D_{prot}': r'($a_{prot}$ * #F_{prot}(t)# - D_{prot}) / $\tau_{prot}$',
        #    'J_{prot}': r'(D_{prot} - J_{prot}) / $\tau_{prot}$',


    # два - выходы мочевины и холестерола.

      #   Экскреция мочевины = UUN (Urine urea nitrogen) - мочевина в суточной моче, в среднем 570 ммоль/сут
      #   '@EXCR_{Urea}@': 570 (10**(-3))

      #    Холестерин: синтезируется 0,8 г/сут, приходит с пищей 0,4 г/сут, экскреция 1,2 г/сут

      #   '@J_{cholesterol}@': 0,4 г/сут
      #   '@EXCR_{Cholesterol}@': 1,2 г/сут


    # 2. Myocyte

    '@M_1@': r'$m_{1}$ * [Glu]_{ef} * #f([INS]_{m1})#',
    '@M_2@': r'$m_{2}$ * [Pyr]_{m}',
    '@M_3@': r'$m_{3}$ * [KB]_{ef}',
    '@M_4@': r'$m_{4}$ * [FFA]_{ef} * #f([INS]_{m4})#',
    '@M_5@': r'$m_{5}$ * [AA]_{ef}',
    '@M_6@': r'$m_{6}$ * [AA]_{m}',
    '@M_7@': r'$m_{7}$ * [G6]_{m} * #f([INS]_{m7})#',
    '@M_8@': r'$m_{8}$ * [GG]_{m} * #f([GLN]_{m8})# * #f([CAM]_{m8})#',
    '@M_9@': r'$m_{9}$ * [G6]_{m} * #f([INS]_{m9})#',
    '@M_10@': r'$m_{10}$ * [G3]_{m}',
    '@M_11@': r'$m_{11}$ * [Pyr]_{m} * #f([INS]_{m11})#',
    '@M_12@': r'$m_{12}$ * [FA-CoA]_{m}',
    '@M_13@': r'$m_{13}$ * [Ac-CoA]_{m} * [OAA]_{m}',
    '@M_14@': r'$m_{14}$ * [Cit]_{m}',
    '@M_15@': r'$m_{15}$ * [H-cyt]_{m}',
    '@M_16@': r'$m_{16}$ * [H-mit]_{m}', # * [O2]',
    '@M_17@': r'$m_{17}$ * [AA]_{m}',
    '@M_18@': r'$m_{18}$ * [AA]_{m}',
    '@M_19@': r'$m_{19}$ * [AA]_{m}',
    '@M_20@': r'$m_{20}$ * [AA]_{m}',
    '@M_21@': r'$m_{21}$ * [Muscle]_{m}',



    #3. Adipocyte

    '@A_1@': r'$a_{1}$ * [AA]_{ef}',
    '@A_2@': r'$a_{2}$ * [FFA]_{ef} * #f([INS]_{a2})#',
    '@A_3@': r'$a_{3}$ * [TG]_{a} * #f([GLN]_{a3})# * #f([CAM]_{a3})#',
    '@A_4@': r'$a_{4}$ * [Glu]_{ef} * #f([INS]_{a4})#',
    '@A_5@': r'$a_{5}$ * [G6]_{a} * #f([INS]_{a5})#',
    '@A_6@': r'$a_{6}$ * [G6]_{a}',
    '@A_7@': r'$a_{7}$ * [G3]_{a} * [FA-CoA]_{a} * #f([INS]_{a7})#',
    '@A_8@': r'$a_{8}$ * [G3]_{a}',
    '@A_9@': r'$a_{9}$ * [OAA]_{a} * #f([GLN]_{a9})#',
    '@A_10@': r'$a_{10}$ * [Pyr]_{a} * #f([INS]_{a10})#',
    '@A_11@': r'$a_{11}$ * [Pyr]_{a} * #f([GLN]_{a11})#',
    '@A_12@': r'$a_{12}$ * [OAA]_{a}',
    '@A_13@': r'$a_{13}$ * [Ac-CoA]_{a} * [NADPH]_{a}',
    '@A_14@': r'$a_{14}$ * [Cit]_{a} * #f([INS]_{a14})#',
    '@A_15@': r'$a_{15}$ * [Cit]_{a}',
    '@A_16@': r'$a_{16}$ * [OAA]_{a} * [Cit]_{a}',
    '@A_17@': r'$a_{17}$ * [AA]_{a}',
    '@A_18@': r'$a_{18}$ * [AA]_{a}',
    '@A_19@': r'$a_{19}$ * [AA]_{a}',

    #4. Hepatocyte

    '@H_1@': r'$h_{1}$ * [AA]_{ef}',
    '@H_2@': r'$h_{2}$ * [G6]_{h} * #f([GLN]_{h2})#',
    '@H_3@': r'$h_{3}$ * [Glu]_{ef} * #f([INS]_{h3})#',
    '@H_4@': r'$h_{4}$ * [Glycerol]_{ef}',
    '@H_5@': r'$h_{5}$ * [Lac]_{m}',
    '@H_6@': r'$h_{6}$ * [Ac-CoA]_{h} * #f([INS]_{h6})#',
    '@H_7@': r'$h_{7}$ * [MVA]_{h} * #f([INS]_{h7})#',
    '@H_8@': r'$h_{8}$ * [FFA]_{ef}',
    '@H_9@': r'$h_{9}$ * [TG]_{h}',
    '@H_10@': r'$h_{10}$ * [G6]_{h} * #f([INS]_{h10})#',
    '@H_11@': r'$h_{11}$ * [GG]_{h} * #f([GLN]_{h11})# * #f([CAM]_{h11})#',
    '@H_12@': r'$h_{12}$ * [G6]_{h} * #f([INS]_{h12})#',
    '@H_13@': r'$h_{13}$ * [G3]_{h}',
    '@H_14@': r'$h_{14}$ * [G6]_{h}',
    '@H_15@': r'$h_{15}$ * [G3]_{h}',
    '@H_16@': r'$h_{16}$ * [Pyr]_{h} * #f([INS]_{h16})#',
    '@H_17@': r'$h_{17}$ * [Ac-CoA]_{h} * [NADPH]_{h} * #f([INS]_{h17})#',
    '@H_18@': r'$h_{18}$ * [FA-CoA]_{h}  * #f([GLN]_{h18})#',
    '@H_19@': r'$h_{19}$ * [Ac-CoA]_{h} * [NADPH]_{h} * #f([INS]_{h19})#',
    '@H_20@': r'$h_{20}$ * [G3]_{h} * [FA-CoA]_{h} * #f([INS]_{h20})#',
    '@H_21@': r'$h_{21}$ * [Ac-CoA]_{h} * [OAA]_{h}',
    '@H_22@': r'$h_{22}$ * [Cit]_{h}',
    '@H_23@': r'$h_{23}$ * [OAA]_{h} * #f([GLN]_{h23})#',
    '@H_24@': r'$h_{24}$ * [OAA]_{h} * #f([INS]_{h24})#',
    '@H_25@': r'$h_{25}$ * [Pyr]_{h} * #f([GLN]_{h25})# * #f([CAM]_{h25})#',
    '@H_26@': r'$h_{26}$ * [AA]_{h}',
    '@H_27@': r'$h_{27}$ * [AA]_{h}',
    '@H_28@': r'$h_{28}$ * [AA]_{h}',
    '@H_29@': r'$h_{29}$ * [AA]_{h}',


}
des_str_ = {

    # Метаболиты

    # 1. Adipocyte

    r'[TG]_{a}': r'@A_7@ - @A_3@',
    r'[AA]_{a}': r'@A_1@ - @A_17@ - @A_18@ - @A_19@',
    r'[G6]_{a}': r'@A_4@ - @A_5@ - @A_6@',
    r'[G3]_{a}': r'2*@A_5@ + @A_6@ + @A_9@ - @A_7@ - @A_8@',
    r'[Pyr]_{a}': r'@A_8@ + @A_12@ + @A_19@ - @A_10@ - @A_11@',
    r'[Ac-CoA]_{a}': r'@A_10@ + @A_14@ + @A_18@ - 8*@A_13@ - @A_16@',
    r'[FA-CoA]_{a}': r'@A_2@ + @A_13@ - 3*@A_7@',
    r'[Cit]_{a}': r'@A_16@ - @A_14@ - @A_15@',
    r'[OAA]_{a}': r'@A_11@ + @A_14@ + @A_15@ + @A_17@ - @A_9@ - @A_12@ - @A_16@ ',
    r'[NADPH]_{a}': r'@A_6@ + @A_12@ - 14*@A_13@',

    # 2. Hepatocyte

    r'[GG]_{h}': r'@H_10@ - @H_11@',
    r'[G6]_{h}': r'@H_3@ + @H_11@ + @H_13@ - @H_2@ - @H_10@ - @H_12@ - @H_14@',
    r'[G3]_{h}': r'@H_4@ + 2*@H_12@ + @H_14@ + @H_23@ - 2*@H_13@ - @H_15@ - @H_20@',
    r'[Pyr]_{h}': r'@H_5@ + @H_15@ + @H_24@ + @H_29@ - @H_16@ - @H_25@',
    r'[Ac-CoA]_{h}': r'@H_16@ + 8*@H_18@ + @H_26@ + @H_27@ - 3*@H_17@ - 8*@H_19@',
    r'[FA-CoA]_{h}': r'@H_8@ + @H_19@ - @H_18@ - 3*@H_20@',
    r'[TG]_{h}': r'@H_20@ - @H_9@',
    r'[MVA]_{h}': r'@H_17@ - @H_7@',
    r'[OAA]_{h}': r'@H_22@ + @H_25@ + @H_26@  + @H_28@ - @H_21@ - @H_23@ - @H_24@',
    r'[Cit]_{h}': r'@H_21@ - @H_22@ - @H_26@',
    r'[AA]_{h}': r'@H_1@ - @H_27@ - @H_28@ - @H_29@',
    r'[NADPH]_{h}': r'6*@H_14@ + @H_24@ - 14*@H_19@',

    # 3. Myocyte

    r'[GG]_{m}': r'@M_7@ - @M_8@',
    r'[G6]_{m}': r'@M_1@ + @M_8@ - @M_7@ - @M_9@',
    r'[G3]_{m}': r'2*@M_9@ - @M_10@',
    r'[Pyr]_{m}': r'@M_10@ + @M_17@ - @M_11@ - @M_2@',
    r'[Ac-CoA]_{m}': r'2*@M_3@ + @M_11@ + 8*@M_12@ + @M_18@ - @M_13@',
    r'[FA-CoA]_{m}': r'@M_4@ - @M_12@',
    r'[AA]_{m}': r'@M_5@ + @M_21@ - @M_6@ - @M_17@ - @M_18@ - @M_19@ - @M_20@',
    r'[Cit]_{m}': r'@M_13@ - @M_14@',
    r'[OAA]_{m}': r'@M_14@ + @M_19@ - @M_13@',
    r'[H-cyt]_{m}': r'2*@M_10@ - @M_2@ - @M_15@',
    r'[H-mit]_{m}': r'@M_3@ + 14*@M_12@ + @M_15@ - @M_16@',
    r'[CO2]_{m}': r'@M_11@ + 2*@M_14@',
    r'[H2O]_{m}': r'@M_16@',

    r'[ATP-cyt]_{m}': r'@M_10@', # Anaerob
    r'[ATP-mit]_{m}': r'2*@M_16@', # Aerob


     # Далее три величины, которые требуют обсуждения.
     # Работа (аэробная и анаэробная) - является ли она интегральной величиной?
     # Или это просто "депо" ккал, которое должно обнуляться каждую полночь?
     # Зависит ли концентрация кислорода от ЧСС, или он просто всегда в избытке (равен единице)?

     #   '[O2]_{m}': r'',
     #   'ANAEROB': r'',
     #   'AEROB': r'',


    # 4. Extracellular fluid

    # Плазма крови для TG и межклеточная жидкость для всех остальных.
    # Отличие - в объеме: плазма - 5,5 л, вся МЖ - около 10 л).

    # Diet-induced concentrations (нутриенты в крови):
    r'[Glu]_{ef}': r'J_{carb} + @H_2@ - @H_3@ - @M_1@ - @A_4@ - @J_1@',
    r'[AA]_{ef}': r'J_{prot} + @M_6@ - @A_1@ - @H_1@ - @J_4@ - @M_5@',
    r'[TG]_{pl}': r'J_{fat} + @H_9@ - @J_0@',

    # Metabolome (метаболиты в крови):
    r'[Glycerol]_{ef}': r'@J_0@ + @A_3@ - @H_4@',
    r'[FFA]_{ef}': r'3*@J_0@ + 3*@A_3@ - @A_2@ - @H_8@ - @M_4@ - @J_3@',
    r'[Lac]_{m}': r'@M_2@ - @H_5@',
    r'[KB]_{ef}': r'@H_6@ - @M_3@ - @J_2@',
    r'[Cholesterol]_{pl}': r'@H_7@',
    r'[Urea]_{ef}': r'@J_4@ + @A_17@ + @A_18@ + @A_19@ + @M_17@ + @M_18@ + @M_19@ + @H_27@ + @H_28@ + @H_29@',

    # Excreted substances (мочевина, холестерин):
    # Для этих веществ нужно добавить в уравнение экскрецию как вычитаемую константу EXCR_{},
    # либо обнулять их депо каждую полночь.

    # '[Urea]_{ef}': r'@J_4@ + @A_17@ + @A_18@ + @A_19@ + @M_17@ + @M_18@ + @M_19@ + @H_27@ + @H_28@ + @H_29@' #- EXCR_{Urea},
    #  '[Cholesterol]_{pl}': r'@H_6@ + J_{cholesterol}@ - EXCR_{Cholesterol}',



    # Вход нутриентов (здесь ничего не меняю, это часть старого кода)
    r'D_{carb}': r'($a_{carb}$ * #F_{carb}(t)# - D_{carb}) / $\tau_{carb}$',
    r'J_{carb}': r'(D_{carb} - J_{carb}) / $\tau_{carb}$',
    r'D_{fat}': r'($a_{fat}$ * #F_{fat}(t)# - D_{fat}) / $\tau_{fat}$',
    r'J_{fat}': r'(D_{fat} - J_{fat}) / $\tau_{fat}$',
    r'D_{prot}': r'($a_{prot}$ * #F_{prot}(t)# - D_{prot}) / $\tau_{prot}$',
    r'J_{prot}': r'(D_{prot} - J_{prot}) / $\tau_{prot}$',

    # Гормоны:

    r'[INS]': r'$\alpha$ * J_{carb} +$\beta$ * J_{fat} + $\gamma$ * J_{prot} - $CL_{INS}$ * [INS]',

    # Добавим две новые функции гормонов (их надо обсудить и исправить):

    #'[GLN]': r'$\lambda$ * (1/[Glu]_{ef}) - $CL_{GLN}$ * [GLN]',
    #'[CAM]': r'$\sigma$ * [Heart Rate] - $CL_{CAM}$ * [CAM]'

    # Глюкагон [GLN] обратно зависим от концентрации [Glu]_{ef} (глюкозы в межклет жидкости).
    # GLN Выделяется при [Glu]_{ef} < 4 mmol/l.

    # Андреналин/норадреналин [CAM] можно отслеживать по пульсу.
    # Если пульс выше возрастной нормы, значит, [CAM] повышен.

    # Клиренс у всех трёх гормонов: полный - 5 минут, 50% - около 1 минуты. Падает экспоненциально.

}
# # переменные выделяются '$' с обеих сторон
# # сокращения выделяются '@' с обеих сторон
# # функции выделяются '#' с обеих сторон
# # врехний индекс запрещен
# # вложенный нижний индекс запрещен
# import os
# from numba import jit
# import numpy as np
# import config
# import matplotlib.pyplot as plt
# from myo_supportfs import read_diet, make_Fcarb, make_Fprot, make_Ffat
# # from Plotting.myplt import plot_vec

# system_functions = {
#     r'F_{carb}':    {'py_name': 'F_carb',       'module': 'sysv1_de_config'},
#     r'F_{fat}':     {'py_name': 'F_fat',        'module': 'sysv1_de_config'},
#     r'F_{prot}':    {'py_name': 'F_prot',       'module': 'sysv1_de_config'},
#     r'f':           {'py_name': 'sigmoid',      'module': 'sysv1_de_config'}
# }

# write_generated_code_to = os.path.join(config.project_path, 'SystemV1')
# write_latex_view_of_system_to = os.path.join(config.project_path, 'SystemV1')
# name_of_generated_pyhton_file = 'gen_des.py'

# diet_table_path = os.path.join(config.problem_folder, 'diet_Mikhail.xlsx')
# diet_data = read_diet(diet_table_path)
# F_carb = make_Fcarb(diet_data)
# F_prot = make_Fprot(diet_data)
# F_fat  = make_Ffat(diet_data)



# @jit(nopython=True, cache=True)
# def sigmoid(x, alpha, beta, gamma, delta):
#     # limitations
#     # beta > alpha
#     # delta >= gamma
#     # if delta <= gamma:
#     #     print('delta <= gamma in sigmoid')
#     #     raise SystemExit
#     if x < alpha:
#         return gamma
#     if x > beta:
#         return delta
#     if alpha <= x <= beta:
#         return (delta-gamma)/(beta-alpha)*x+(gamma*beta-delta*alpha)/(beta-alpha)


# tau = 0.01  # [min]
# t0 = 0.0 # [min]
# tend = 1440.0*2 # [min]
# # tend = 50.0 # [min]

# # t = np.linspace(start=t0, stop=tend, num=int((tend-t0)/tau)+1)
# # ycarb=[F_carb(t[i]) for i in range(len(t))]
# # plot_vec(t,ycarb,title = "carbs [g]",block=False)
# # yfat=[F_fat(t[i]) for i in range(len(t))]
# # plot_vec(t,yfat,title = "fats [g]",block=False)
# # yprot=[F_prot(t[i]) for i in range(len(t))]
# # plot_vec(t,yprot,title = "prots [g]",block=False)
# # plt.show()

# # параметры alpha beta gamma delta должны быть того же порядка, как и аргументы для функции f
# params_values = {

#     ### INS
#     r'$\alpha$':      2.0,      
#     r'$\lambda$': 2.0,
#     r'$\sigma$': 2.0,

#     r'$CL_{INS}$':          0.1,

#     r'$\alpha_{a2}$':       1.0,
#     r'$\alpha_{a4}$':       1.0,
#     r'$\alpha_{a5}$':       1.0,
#     r'$\alpha_{a7}$':       1.0,
#     r'$\alpha_{a10}$':      1.0,

#     r'$\alpha_{m1}$':       1.0,
#     r'$\alpha_{m3}$':       1.0,
#     r'$\alpha_{m6}$':       1.0,
#     r'$\alpha_{m8}$':       1.0,
#     r'$\alpha_{m10}$':      1.0,

#     r'$\alpha_{h3}$':       1.0,
#     r'$\alpha_{h6}$':       1.0,
#     r'$\alpha_{h8}$':       1.0,
#     r'$\alpha_{h10}$':      1.0,
#     r'$\alpha_{h12}$':      1.0,
#     r'$\alpha_{h17}$':      1.0,
#     r'$\alpha_{h29}$':      1.0,
#     r'$\alpha_{h30}$':      1.0,

#     ###

#     r'$\beta$':             0.02,
#     r'$\beta_{a2}$':        2.0,
#     r'$\beta_{a4}$':        2.0,
#     r'$\beta_{a5}$':        2.0,
#     r'$\beta_{a7}$':        2.0,
#     r'$\beta_{a10}$':       2.0,

#     r'$\beta_{m1}$':        2.0,
#     r'$\beta_{m3}$':        2.0,
#     r'$\beta_{m6}$':        2.0,
#     r'$\beta_{m8}$':        2.0,
#     r'$\beta_{m10}$':       2.0,

#     r'$\beta_{h3}$':        2.0,
#     r'$\beta_{h6}$':        2.0,
#     r'$\beta_{h8}$':        2.0,
#     r'$\beta_{h10}$':       2.0,
#     r'$\beta_{h12}$':       2.0,
#     r'$\beta_{h17}$':       2.0,
#     r'$\beta_{h29}$':       2.0,
#     r'$\beta_{h30}$':       2.0,

#     ###

#     r'$\delta_{a2}$':       2.0,
#     r'$\delta_{a4}$':       2.0,
#     r'$\delta_{a5}$':       2.0,
#     r'$\delta_{a7}$':       2.0,
#     r'$\delta_{a10}$':      2.0,

#     r'$\delta_{m1}$':       2.0,
#     r'$\delta_{m3}$':       2.0,
#     r'$\delta_{m6}$':       2.0,
#     r'$\delta_{m8}$':       2.0,
#     r'$\delta_{m10}$':      2.0,

#     r'$\delta_{h3}$':       2.0,
#     r'$\delta_{h6}$':       2.0,
#     r'$\delta_{h8}$':       2.0,
#     r'$\delta_{h10}$':      2.0,
#     r'$\delta_{h12}$':      2.0,
#     r'$\delta_{h17}$':      2.0,
#     r'$\delta_{h29}$':      2.0,
#     r'$\delta_{h30}$':      2.0,

#     ###

#     r'$\gamma$':            1.0,
#     r'$\gamma_{a2}$':       1.0,
#     r'$\gamma_{a4}$':       1.0,
#     r'$\gamma_{a5}$':       1.0,
#     r'$\gamma_{a7}$':       1.0,
#     r'$\gamma_{a10}$':      1.0,

#     r'$\gamma_{m1}$':       1.0,
#     r'$\gamma_{m3}$':       1.0,
#     r'$\gamma_{m6}$':       1.0,
#     r'$\gamma_{m8}$':       1.0,
#     r'$\gamma_{m10}$':      1.0,

#     r'$\gamma_{h3}$':       1.0,
#     r'$\gamma_{h6}$':       1.0,
#     r'$\gamma_{h8}$':       1.0,
#     r'$\gamma_{h10}$':      1.0,
#     r'$\gamma_{h12}$':      1.0,
#     r'$\gamma_{h17}$':      1.0,
#     r'$\gamma_{h29}$':      1.0,
#     r'$\gamma_{h30}$':      1.0,



#     ###


# #    r'$\j_{0}$': 1.0,
# #    r'$\j_{1}$': 1.0,
# #    r'$\j_{2}$': 0.0,
# #    r'$\j_{3}$': 1.0,
# #    r'$\j_{4}$': 1.0,

#     # BMR: j_{1} + j_{2} + j_{3} + j_{4}
#     # AEROB: m_{14}
#     # ANAEROB: m_{9}



#                 ### GLN

#     r'$CL_{GLN}$':          0.1,
#     r'$\lambda_{a3}$':      1.0,
#     r'$\lambda_{a9}$':      1.0,
#     r'$\lambda_{a11}$':     1.0,
#     r'$\lambda_{m7}$':      1.0,
#     r'$\lambda_{h2}$':      1.0,
#     r'$\lambda_{h11}$':     1.0,
#     r'$\lambda_{h15}$':     1.0,
#     r'$\lambda_{h25}$':     1.0,

#                 ## CAM

#     r'$CL_{CAM}$':          0.1,
#     # r'$\sigma_{a3}$':       1.0,
#     # r'$\sigma_{m7}$':       1.0,
#     # r'$\sigma_{h11}$':      1.0,

#                 ###

#     r'$\tau_{carb}$':     60.0,     # [min]
#     r'$\tau_{fat}$':      110.0,    # [min]
#     r'$\tau_{prot}$':     90.0,     # [min}

#     '$a_{carb}$':         1.0,
#     '$a_{fat}$':          1.0,
#     '$a_{prot}$':         1.0,

#    # поменяла номера коэффициентов

#     '$j_{0}$':            10.0**(-5),
#     '$j_{1}$':            10.0**(-5),
#     '$j_{2}$':            10.0**(-5),
#     '$j_{3}$':            10.0**(-5),
#     '$j_{4}$':            10.0**(-5),

#     '$a_{1}$':            10.0**(-5),
#     '$a_{2}$':            10.0**(-5),
#     '$a_{3}$':            10.0**(-5),
#     '$a_{4}$':            10.0**(-5),
#     '$a_{5}$':            10.0**(-5),
#     '$a_{6}$':            10.0**(-5),
#     '$a_{7}$':            10.0**(-5),
#     '$a_{8}$':            10.0**(-5),
#     '$a_{9}$':            10.0**(-5),
#     '$a_{10}$':            10.0**(-5),
#     '$a_{11}$':            10.0**(-5),
#     '$a_{12}$':            10.0**(-5),  # *[Carnitin]
#     '$a_{13}$':            10.0**(-5),
#     '$a_{14}$':            10.0**(-5),
#     '$a_{15}$':            10.0**(-5),
#     '$a_{16}$':            10.0**(-5),
#     '$a_{17}$':            10.0**(-5),
#     '$a_{18}$':            10.0**(-5),
#     '$a_{19}$':            10.0**(-5),
#     '$a_{20}$':            10.0**(-5),
#     '$a_{21}$':            10.0**(-5),

#     '$m_{1}$':            10.0**(-5),
#     '$m_{2}$':            10.0**(-5),
#     '$m_{3}$':            10.0**(-5),
#     '$m_{4}$':            10.0**(-5),
#     '$m_{5}$':            10.0**(-5),
#     '$m_{6}$':            10.0**(-5),
#     '$m_{7}$':            10.0**(-5),
#     '$m_{8}$':            10.0**(-5),
#     '$m_{9}$':            10.0**(-5),
#     '$m_{10}$':           10.0**(-5),
#     '$m_{11}$':           10.0**(-5),   # *[Carnitin]
#     '$m_{12}$':           10.0**(-5),
#     '$m_{13}$':           10.0**(-5),
#     '$m_{14}$':           10.0**(-5),   # *[Creatin]
#     '$m_{15}$':           10.0**(-5),
#     '$m_{16}$':           10.0**(-5),
#     '$m_{17}$':           10.0**(-5),
#     '$m_{18}$':           10.0**(-5),
#     '$m_{19}$':           10.0**(-5),
#     '$m_{20}$':           10.0**(-5),
#     '$m_{21}$':           10.0**(-5),

#     '$h_{1}$':            10.0**(-5),
#     '$h_{2}$':            10.0**(-5),
#     '$h_{3}$':            10.0**(-5),
#     '$h_{4}$':            10.0**(-5),
#     '$h_{5}$':            10.0**(-5),
#     '$h_{6}$':            10.0**(-5),
#     '$h_{7}$':            10.0**(-5),
#     '$h_{8}$':            10.0**(-5),
#     '$h_{9}$':            10.0**(-5),
#     '$h_{10}$':            10.0**(-5),
#     '$h_{11}$':            10.0**(-5),
#     '$h_{12}$':            10.0**(-5),
#     '$h_{13}$':            10.0**(-5),
#     '$h_{14}$':            10.0**(-5),
#     '$h_{15}$':            10.0**(-5),
#     '$h_{16}$':            10.0**(-5),
#     '$h_{17}$':            10.0**(-5),
#     '$h_{18}$':            10.0**(-5),  # *[Carnitin]
#     '$h_{19}$':            10.0**(-5),
#     '$h_{20}$':            10.0**(-5),
#     '$h_{21}$':            10.0**(-5),
#     '$h_{22}$':            10.0**(-5),
#     '$h_{23}$':            10.0**(-5),
#     '$h_{24}$':            10.0**(-5),
#     '$h_{25}$':            10.0**(-5),
#     '$h_{26}$':            10.0**(-5),
#     '$h_{27}$':            10.0**(-5),
#     '$h_{28}$':            10.0**(-5),
#     '$h_{29}$':            10.0**(-5),
#     '$h_{30}$':            10.0**(-5),
# }
# # print(len(params_values.keys()))
# # raise SystemExit
# # моделирование инсулина #doi: 10.1016/S1674-8301(10)60048-6
# # некоторые единицы https://unitslab.com/ru/node/40 с базой

# start_point = {
#     '[GLN]': 1.0,

#     '[CAM]': 1.0,

#     '[INS]' : 1.0,
#     '[OAA]_{m}': 1.0,


#     # эти шесть строк из старого кода
#     'D_{carb}':                 1.0,
#     'D_{fat}':                  1.0,
#     'D_{prot}':                 1.0,
#     'J_{carb}':                 1.0,
#     'J_{fat}':                  1.0, # mmol/L
#     'J_{prot}':                 1.0,

#     # новые строки:

#     # 0. Состав тела (биоимпеданс)

#     #Skelet muscle mass: 21 kg
#     #Fat mass: 13 kg
#     #Extracellular fluid: 11 l


#     # 1. Extracellular fluid             Объем воды в компартменте = 11 l (из биоимпеданса)

#    '[Glu]_{ef}':          4.5,         # mmol/l (средний референс для здоровых людей)

#     '[AA]_{ef}':           4.0,         # mmol/l

#                                         # здесь нас интересует лишь общее содержание аминогрупп.
#                                         # примеры концентраций аминокислот:
#                                         # Лей - 150-300 мкмоль,Ала - 300-500 мкмоль,Тир - 30-120 мкмоль/л
#                                         # предположим, у всех концентрация сопоставимая - ок. 200 мкмоль/л.
#                                         # Тогда в сумме 200 * 20= 4000 мкмоль = 4 ммоль/л.
#                                         # μmol/l - мкмоль, 10.0**(-6) моль

#     '[Glycerol]_{ef}':     0.2,         # mmol/l
#                                         # точно ниже 300 µmol/L (0,3 mmol/l). Пусть будет 0,2 mmol/l

#     '[FFA]_{ef}':          6.0,         # mmol/l

#                                         # Олеиновая кислота (С18:1w9)	650,00 – 3500,00 мкмоль/л (2075)
#                                         # Пальмитиновая кислота (С16:0)	1480,00 – 3730,00 мкмоль/л (2605)
#                                         # Пальмитолеиновая кислота (С16:1w7)	110,00 – 1130,00 мкмоль/л (620)
#                                         # Стеариновая кислота (С18:0)	590,00 – 1170,00 мкмоль/л (880)
#                                         # Сумма средних концентраций: 6180 мкмоль/л, пусть будет 6 ммоль/л
#                                         # Остальные в 10 и более раз меньше, игнорируем

#     '[Lac]_{m}':           0.0,        # mmol/l
#                                         # В нашей модели лактат образуется только в результате анаэробной работы.
#                                         # Поэтому на старте он = 0.

#     '[KB]_{ef}':           0.0,        # mmol/l
#                                         # В нашей модели кетоновые тела образуются только с безуглеводным рационом.
#                                         # Поэтому на старте они = 0.



#     '[BMR]':                0.0,


#     '[Cholesterol]_{pl}':   4.5,        # mmol/l (средний референс для здоровых людей)


#  #  '[Urea]_{ef}':          5.0,        # mmol/l (средний референс для здоровых людей)

#     '[TG]_{pl}':            1.5,        # mmol/l (средний референс для здоровых людей)

# # 2. Adipocyte

#     '[G6]_{a}':             1.0,        # mmol/l
#     '[G3]_{a}':             1.0,
#     '[Pyr]_{a}':            1.0,
#     '[Ac-CoA-mit]_{a}':     1.0,
#     '[Ac-CoA-cyt]_{a}':     1.0,
#     '[FA-CoA]_{a}':         1.0,
#     '[Cit]_{a}':            1.0,
#     '[OAA-mit]_{a}':        1.0,
#     '[OAA-cyt]_{a}':        1.0,
#     '[AA]_{a}':             1.0,
#     '[NADPH]_{a}':          1.0,
#     '[TG]_{a}':             10.0,        # = масса жира из биоимпеданса (13 кг)


# # 3. Myocyte                Объем жидкости в компартменте = 70% массы скелетных мышц.
#                             # пример: 21 кг * 0,7 = 14, 7 кг; объем = 14,7 л

#     '[GG]_{m}':             1.0,        # 14г/кг мышечной массы. на 21 кг - примерно 300 г
#     '[G6]_{m}':             1.0,
#     '[G3]_{m}':             1.0,
#     '[Pyr]_{m}':            1.0,
#     '[Ac-CoA]_{m}':         1.0,
#     '[FA-CoA]_{m}':         1.0,
#     '[Cit]_{m}':            1.0,
#     '[OAA-mit]_{m}':        1.0,
#     '[H-cyt]_{m}':          1.0,
#     '[H-mit]_{m}':          1.0,

#     '[AA]_{m}':             1.0,
#     '[Muscle]':             10.0,        # = сухой белок мышц = 19% массы мышц

#  #   '[O2]_{m}':             0.0,
#     '[CO2]_{m}':            0.0,
#     '[H2O]_{m}':            0.0,

#  #   '[ANAEROB]':        0.0,
#  #   '[AEROB]':          0.0,


# # 4. Hepatocyte             Объем жидкости в компартменте = 1 l, масса печени 1,5 кг

#     '[GG]_{h}':             1.0,        # максимум = 100 г
#     '[G6]_{h}':             1.0,
#     '[G3]_{h}':             1.0,
#     '[Pyr]_{h}':            1.0,
#     '[Ac-CoA-mit]_{h}':     1.0,
#     '[Ac-CoA-cyt]_{h}':     1.0,
#     '[FA-CoA]_{h}':         1.0,
#     '[HMG-CoA]_{h}':        1.0,
#     '[Cit]_{h}':            1.0,
#     '[OAA-mit]_{h}':        1.0,
#     '[OAA-cyt]_{h}':        1.0,
#     '[NADPH]_{h}':          1.0,
#     '[AA]_{h}':             1.0,
#     '[TG]_{h}':             1.0,        # максимум = 60 г (жирность печени - 4 г жира/100 г)

# }


# aliases_ = {

#     # new aliases for Neo_Chart - сокращения

#     # 0. Hormone functions (INS GLN CAM)

#     # INS

#     '@f([INS]_{a2})@':  r'#f([INS],$\alpha_{a2}$,$\beta_{a2}$,$\gamma_{a2}$,$\delta_{a2}$)#',
#     '@f([INS]_{a4})@':  r'#f([INS],$\alpha_{a4}$,$\beta_{a4}$,$\gamma_{a4}$,$\delta_{a4}$)#',
#     '@f([INS]_{a5})@':  r'#f([INS],$\alpha_{a5}$,$\beta_{a5}$,$\gamma_{a5}$,$\delta_{a5}$)#',
#     '@f([INS]_{a7})@':  r'#f([INS],$\alpha_{a7}$,$\beta_{a7}$,$\gamma_{a7}$,$\delta_{a7}$)#',
#     '@f([INS]_{a10})@': r'#f([INS],$\alpha_{a10}$,$\beta_{a10}$,$\gamma_{a10}$,$\delta_{a10}$)#',

#     '@f([INS]_{m1})@':  r'#f([INS],$\alpha_{m1}$,$\beta_{m1}$,$\gamma_{m1}$,$\delta_{m1}$)#',
#     '@f([INS]_{m3})@':  r'#f([INS],$\alpha_{m3}$,$\beta_{m3}$,$\gamma_{m3}$,$\delta_{m3}$)#',
#     '@f([INS]_{m6})@':  r'#f([INS],$\alpha_{m6}$,$\beta_{m6}$,$\gamma_{m6}$,$\delta_{m6}$)#',
#     '@f([INS]_{m8})@':  r'#f([INS],$\alpha_{m8}$,$\beta_{m8}$,$\gamma_{m8}$,$\delta_{m8}$)#',
#     '@f([INS]_{m10})@': r'#f([INS],$\alpha_{m10}$,$\beta_{m10}$,$\gamma_{m10}$,$\delta_{m10}$)#',

#     '@f([INS]_{h3})@':  r'#f([INS],$\alpha_{h3}$,$\beta_{h3}$,$\gamma_{h3}$,$\delta_{h3}$)#',
#     '@f([INS]_{h6})@':  r'#f([INS],$\alpha_{h6}$,$\beta_{h6}$,$\gamma_{h6}$,$\delta_{h6}$)#',
#     '@f([INS]_{h8})@':  r'#f([INS],$\alpha_{h8}$,$\beta_{h8}$,$\gamma_{h8}$,$\delta_{h8}$)#',
#     '@f([INS]_{h10})@': r'#f([INS],$\alpha_{h10}$,$\beta_{h10}$,$\gamma_{h10}$,$\delta_{h10}$)#',
#     '@f([INS]_{h12})@': r'#f([INS],$\alpha_{h12}$,$\beta_{h12}$,$\gamma_{h12}$,$\delta_{h12}$)#',
#     '@f([INS]_{h17})@': r'#f([INS],$\alpha_{h17}$,$\beta_{h17}$,$\gamma_{h17}$,$\delta_{h17}$)#',
#     '@f([INS]_{h29})@': r'#f([INS],$\alpha_{h29}$,$\beta_{h29}$,$\gamma_{h29}$,$\delta_{h29}$)#',
#     '@f([INS]_{h30})@': r'#f([INS],$\alpha_{h30}$,$\beta_{h30}$,$\gamma_{h30}$,$\delta_{h30}$)#',

#     # GLN

#     '@f([GLN]_{a3})@':  r'#f([G6]_{ef},$\lambda_{a3}$)#',
#     '@f([GLN]_{a9})@':  r'#f([G6]_{ef},$\lambda_{a9}$)#',
#     '@f([GLN]_{a11})@': r'#f([G6]_{ef},$\lambda_{a11}$)#',
#     '@f([GLN]_{m7})@':  r'#f([G6]_{ef},$\lambda_{m7}$)#',
#     '@f([GLN]_{h2})@':  r'#f([G6]_{ef},$\lambda_{h2}$)#',
#     '@f([GLN]_{h11})@': r'#f([G6]_{ef},$\lambda_{h11}$)#',
#     '@f([GLN]_{h15})@': r'#f([G6]_{ef},$\lambda_{h15}$)#',
#     '@f([GLN]_{h25})@': r'#f([G6]_{ef},$\lambda_{h25}$)#',

#     # CAM

#     # '@f([CAM]_{a3})@':  r'#f([Heart Rate],$\sigma_{a3}$)#',
#     # '@f([CAM]_{m7})@':  r'#f([Heart Rate],$\sigma_{m7}$)#',
#     # '@f([CAM]_{h11})@': r'#f([Heart Rate],$\sigma_{h11}$)#',
#     '@f([CAM]_{a3})@':  r'1',
#     '@f([CAM]_{m7})@':  r'1',
#     '@f([CAM]_{h11})@': r'1',

#     # 1. Extracellular fluid

#     '@J_0@': r'$j_{0}$ * [TG]_{pl}',
#     '@J_1@': r'$j_{1}$ * [Glu]_{ef}',
#     '@J_2@': r'$j_{2}$ * [KB]_{ef}',
#     '@J_3@': r'$j_{3}$ * [FFA]_{ef}',
#     '@J_4@': r'$j_{4}$ * [AA]_{ef}',


#     # здесь должно быть ещё пять процессов:
#     # три - входы БЖУ;

#       #  '@J_{carb}@':
#       #  '@J_{prot}@':
#       #  '@J_{fat}@':

#     # Ниже в коде есть такая часть:

#         # Вход нутриентов (часть старого кода)

#         #    'D_{carb}': r'($a_{carb}$ * #F_{carb}(t)# - D_{carb}) / $\tau_{carb}$',
#         #    'J_{carb}': r'(D_{carb} - J_{carb}) / $\tau_{carb}$',
#         #    'D_{fat}': r'($a_{fat}$ * #F_{fat}(t)# - D_{fat}) / $\tau_{fat}$',
#         #    'J_{fat}': r'(D_{fat} - J_{fat}) / $\tau_{fat}$',
#         #    'D_{prot}': r'($a_{prot}$ * #F_{prot}(t)# - D_{prot}) / $\tau_{prot}$',
#         #    'J_{prot}': r'(D_{prot} - J_{prot}) / $\tau_{prot}$',


#     # два - выходы мочевины и холестерола.

#       #   Экскреция мочевины = UUN (Urine urea nitrogen) - мочевина в суточной моче, в среднем 570 ммоль/сут
#       #   '@EXCR_{Urea}@': 570 (10**(-3))

#       #    Холестерин: синтезируется 0,8 г/сут, приходит с пищей 0,4 г/сут, экскреция 1,2 г/сут

#       #   '@J_{cholesterol}@': 0,4 г/сут
#       #   '@EXCR_{Cholesterol}@': 1,2 г/сут




#     # 2. Myocyte

#     '@M_1@': r'$m_{1}$ * [Glu]_{ef} * @f([INS]_{m1})@',
#     '@M_2@': r'$m_{2}$ * [Pyr]_{m} * [H-cyt]_{m}',
#     '@M_3@': r'$m_{3}$ * [FFA]_{ef} * @f([INS]_{m3})@',
#     '@M_4@': r'$m_{4}$ * [AA]_{ef}',
#     '@M_5@': r'$m_{5}$ * [AA]_{m}',
#     '@M_6@': r'$m_{6}$ * [G6]_{m} * @f([INS]_{m6})@',
#     '@M_7@': r'$m_{7}$ * [GG]_{m} * @f([GLN]_{m7})@ * @f([CAM]_{m7})@',
#     '@M_8@': r'$m_{8}$ * [G6]_{m} * @f([INS]_{m8})@',
#     '@M_9@': r'$m_{9}$ * [G3]_{m}',
#     '@M_10@': r'$m_{10}$ * [Pyr]_{m} * @f([INS]_{m10})@',
#     '@M_11@': r'$m_{11}$ * [FA-CoA]_{m}',
#     '@M_12@': r'$m_{12}$ * [Ac-CoA]_{m} * [OAA-mit]_{m}',
#     '@M_13@': r'$m_{13}$ * [Cit]_{m}',
#     '@M_14@': r'$m_{14}$ * [H-mit]_{m}', # * [O2]',
#     '@M_15@': r'$m_{15}$ * [AA]_{m}',
#     '@M_16@': r'$m_{16}$ * [Muscle]',
#     '@M_17@': r'$m_{17}$ * [AA]_{m}',
#     '@M_18@': r'$m_{18}$ * [AA]_{m}',
#     '@M_19@': r'$m_{19}$ * [AA]_{m}',
#     '@M_20@': r'$m_{20}$ * [H-cyt]_{m}',
#     '@M_21@': r'$m_{21}$ * [H-cyt]_{m}',

#     #3. Adipocyte

#     '@A_1@': r'$a_{1}$ * [AA]_{ef}',
#     '@A_2@': r'$a_{2}$ * [FFA]_{ef} * @f([INS]_{a2})@ ',
#     '@A_3@': r'$a_{3}$ * [TG]_{a} * @f([GLN]_{a3})@ * @f([CAM]_{a3})@',
#     '@A_4@': r'$a_{4}$ * [Glu]_{ef} * @f([INS]_{a4})@',
#     '@A_5@': r'$a_{5}$ * [G6]_{a} * @f([INS]_{a5})@',
#     '@A_6@': r'$a_{6}$ * [G6]_{a}',
#     '@A_7@': r'$a_{7}$ * [G3]_{a} * [FA-CoA]_{a} * @f([INS]_{a7})@',
#     '@A_8@': r'$a_{8}$ * [G3]_{a}',
#     '@A_9@': r'$a_{9}$ * [OAA-cyt]_{a} * @f([GLN]_{a9})@',
#     '@A_10@': r'$a_{10}$ * [Pyr]_{a} * @f([INS]_{a10})@',
#     '@A_11@': r'$a_{11}$ * [Pyr]_{a} * @f([GLN]_{a11})@',
#     '@A_12@': r'$a_{12}$ * [Ac-CoA-mit]_{a}',
#     '@A_13@': r'$a_{13}$ * [Ac-CoA-mit]_{a} * [OAA-mit]_{a}',
#     '@A_14@': r'$a_{14}$ * [Cit]_{a}',
#     '@A_15@': r'$a_{15}$ * [Cit]_{a}',
#     '@A_16@': r'$a_{16}$ * [Ac-CoA-cyt]_{a} * [NADPH]_{a}',
#     '@A_17@': r'$a_{17}$ * [OAA-cyt]_{a}',
#     '@A_18@': r'$a_{18}$ * [OAA-cyt]_{a}',
#     '@A_19@': r'$a_{19}$ * [AA]_{a}',
#     '@A_20@': r'$a_{20}$ * [AA]_{a}',
#     '@A_21@': r'$a_{21}$ * [AA]_{a}',

#     #4. Hepatocyte

#     '@H_1@': r'$h_{1}$ * [AA]_{ef}',
#     '@H_2@': r'$h_{2}$ * [G6]_{h} * @f([GLN]_{h2})@',
#     '@H_3@': r'$h_{3}$ * [Glu]_{ef} * @f([INS]_{h3})@',
#     '@H_4@': r'$h_{4}$ * [Glycerol]_{ef}',
#     '@H_5@': r'$h_{5}$ * [Lac]_{m}',
#     '@H_6@': r'$h_{6}$ * [HMG-CoA]_{h} * @f([INS]_{h6})@',
#     '@H_7@': r'$h_{7}$ * [HMG-CoA]_{h}',
#     '@H_8@': r'$h_{8}$ * [FFA]_{ef} * @f([INS]_{h8})@',
#     '@H_9@': r'$h_{9}$ * [TG]_{h}',
#     '@H_10@': r'$h_{10}$ * [G6]_{h} * @f([INS]_{h10})@',
#     '@H_11@': r'$h_{11}$ * [GG]_{h} * @f([GLN]_{h11})@ * @f([CAM]_{h11})@',
#     '@H_12@': r'$h_{12}$ * [G6]_{h} * @f([INS]_{h12})@',
#     '@H_13@': r'$h_{13}$ * [G3]_{h}',
#     '@H_14@': r'$h_{14}$ * [G6]_{h}',
#     '@H_15@': r'$h_{15}$ * [Pyr]_{h} * @f([GLN]_{h15})@',
#     '@H_16@': r'$h_{16}$ * [G3]_{h}',
#     '@H_17@': r'$h_{17}$ * [Pyr]_{h} * @f([INS]_{h17})@',
#     '@H_18@': r'$h_{18}$ * [Ac-CoA-mit]_{h}',
#     '@H_19@': r'$h_{19}$ * [Ac-CoA-cyt]_{h} * [NADPH]_{h}',
#     '@H_20@': r'$h_{20}$ * [Ac-CoA-mit]_{h} * [OAA-cyt]_{h}',
#     '@H_21@': r'$h_{21}$ * [Cit]_{h}',
#     '@H_22@': r'$h_{22}$ * [Cit]_{h}',
#     '@H_23@': r'$h_{23}$ * [OAA-cyt]_{h}',
#     '@H_24@': r'$h_{24}$ * [OAA-cyt]_{h}',
#     '@H_25@': r'$h_{25}$ * [OAA-cyt]_{h} * @f([GLN]_{h25})@',
    # '@H_26@': r'$h_{26}$ * [AA]_{h}',
#     '@H_27@': r'$h_{27}$ * [AA]_{h}',
#     '@H_28@': r'$h_{28}$ * [AA]_{h}',
#     '@H_29@': r'$h_{29}$ * [Ac-CoA-cyt]_{h} * @f([INS]_{h29})@',
#     '@H_30@': r'$h_{30}$ * [G3]_{h} * [FA-CoA]_{h} * @f([INS]_{h30})@',


# }
# des_str_ = {

#     # Метаболиты

#     # 1. Adipocyte

#     '[TG]_{a}': r'@A_7@ - @A_3@',
#     '[AA]_{a}': r'@A_1@ - @A_19@ - @A_20@ - @A_21@',
#     '[G6]_{a}': r'@A_4@ - @A_5@ - @A_6@',
#     '[G3]_{a}': r'@A_5@ + @A_6@ + @A_9@ - @A_7@ - @A_8@',
#     '[Pyr]_{a}': r'@A_8@ + @A_18@ + @A_21@ - @A_10@ - @A_11@',
#     '[Ac-CoA-mit]_{a}': r'@A_10@ + @A_20@ - @A_12@ - @A_13@',
#     '[Ac-CoA-cyt]_{a}': r'@A_12@ + @A_15@ - @A_16@',
#     '[FA-CoA]_{a}': r'@A_2@ + @A_16@ - @A_7@',
#     '[Cit]_{a}': r'@A_13@ - @A_14@ - @A_15@',
#     '[OAA-mit]_{a}': r'@A_14@ + @A_17@ + @A_19@ - @A_13@',
#     '[OAA-cyt]_{a}': r'@A_11@ + @A_15@ - @A_9@ - @A_17@ - @A_18@',
#     '[NADPH]_{a}': r'@A_6@ + @A_18@ - @A_16@',


#     # 2. Hepatocyte

#     '[GG]_{h}': r'@H_10@ - @H_11@',
#     '[G6]_{h}': r'@H_3@ + @H_11@ + @H_13@ - @H_2@ - @H_10@ - @H_12@ - @H_14@',
#     '[G3]_{h}': r'@H_4@ + @H_12@ + @H_14@ + @H_25@ - @H_13@ - @H_16@ - @H_30@',
#     '[Pyr]_{h}': r'@H_5@ + @H_16@ + @H_24@ + @H_27@ - @H_15@ - @H_17@',
#     '[Ac-CoA-mit]_{h}': r'@H_17@ + @H_28@ - @H_18@ - @H_20@',
#     '[Ac-CoA-cyt]_{h}': r'@H_18@ + @H_22@ - @H_19@ - @H_29@',
#     '[FA-CoA]_{h}': r'@H_8@ + @H_19@ - @H_30@',
#     '[TG]_{h}': r'@H_30@ - @H_9@',
#     '[HMG-CoA]_{h}': r'@H_29@ - @H_6@ - @H_7@',
#     '[AA]_{h}': r'@H_1@ - @H_26@ -@H_27@ -@H_28@',
#     '[OAA-cyt]_{h}': r'@H_15@ + @H_22@ - @H_23@ - @H_24@ - @H_25@',
#     '[OAA-mit]_{h}': r'@H_21@ + @H_23@ + @H_26@ - @H_20@',
#     '[Cit]_{h}': r'@H_20@ - @H_21@ - @H_22@',
#     '[NADPH]_{h}': r'@H_14@ + @H_24@ - @H_19@',

#     # 3. Myocyte

#     '[GG]_{m}': r'@M_6@ - @M_7@',
#     '[G6]_{m}': r'@M_1@ + @M_7@ - @M_6@ -@M_8@',
#     '[G3]_{m}': r'@M_8@ - @M_9@',
#     '[Pyr]_{m}': r'@M_9@ + @M_17@ - @M_10@ - @M_2@',
#     '[Ac-CoA]_{m}': r'@M_10@ + @M_11@ + @M_18@ - @M_12@',
#     '[FA-CoA]_{m}': r'@M_3@ - @M_11@',
#     '[AA]_{m}': r'@M_4@ + @M_16@ - @M_5@ - @M_15@ - @M_17@ - @M_18@ - @M_19@',
#     '[Cit]_{m}': r'@M_12@ - @M_13@',
#     '[OAA]_{m}': r'@M_13@ + @M_19@ - @M_12@',
#     '[H-cyt]_{m}': r'@M_9@ - @M_2@ - @M_20@ - @M_21@',
#     '[H-mit]_{m}': r'@M_13@ + @M_20@ + @M_21@ - @M_14@',
#     '[CO2]_{m}': r'@M_10@ + @M_13@',
#     '[OAA-mit]_{m}': r'@M_13@ + @M_19@ - @M_12@',
#     '[Muscle]': r'@M_15@ - @M_16@',
#     '[H2O]_{m}': r'@M_14@',


#  #   '[ANAEROB]': r'@M_9@',
#  #   '[AEROB]': r'@M_14@',

#      # Зависит ли концентрация кислорода от ЧСС, или он просто всегда в избытке (равен единице)?

#      #   '[O2]_{m}': r'',


#     # 4. Extracellular fluid

#     # Плазма крови для TG и межклеточная жидкость для всех остальных.
#     # Отличие - в объеме: плазма - 5,5 л, вся МЖ - около 10 л).

#     # Diet-induced concentrations (нутриенты в крови):
#     '[Glu]_{ef}': r'J_{carb} + @H_2@ - @H_3@ - @M_1@ - @A_4@ - @J_1@',
#     '[AA]_{ef}': r'J_{prot} + @M_5@ - @A_1@ - @H_1@ - @J_4@ -@M_4@',
#     '[TG]_{pl}': r'J_{fat} + @H_9@ - @J_0@',

#     # Metabolome (метаболиты в крови):
#     '[Cholesterol]_{pl}': r'@H_6@',
#     '[Glycerol]_{ef}': r'@J_0@ + @A_3@ - @H_4@',
#     '[FFA]_{ef}': r'@J_0@ + @A_3@ - @A_2@ - @H_8@ - @M_3@ - @J_3@',
#     '[Lac]_{m}': r'@M_2@ - @H_5@',
#     '[KB]_{ef}': r'@H_7@ - @J_2@',

#     '[BMR]': r'@J_1@ + @J_2@ + @J_3@ + @J_4@',

# #    '[Urea]_{ef}': r'@J_4@ + @A_19@ + @A_20@ + @A_21@ + @M_17@ + @M_18@ + @M_19@ + @H_26@ + @H_27@ + @H_28@', # - EXCR_{Urea},
# #  '[Cholesterol]_{pl}': r'@H_6@ + J_{cholesterol}@', # - EXCR_{Cholesterol}',


#     # Вход нутриентов (здесь ничего не меняю, это часть старого кода)
#     'D_{carb}': r'($a_{carb}$ * #F_{carb}(t)# - D_{carb}) / $\tau_{carb}$',
#     'J_{carb}': r'(D_{carb} - J_{carb}) / $\tau_{carb}$',
#     'D_{fat}': r'($a_{fat}$ * #F_{fat}(t)# - D_{fat}) / $\tau_{fat}$',
#     'J_{fat}': r'(D_{fat} - J_{fat}) / $\tau_{fat}$',
#     'D_{prot}': r'($a_{prot}$ * #F_{prot}(t)# - D_{prot}) / $\tau_{prot}$',
#     'J_{prot}': r'(D_{prot} - J_{prot}) / $\tau_{prot}$',

#     # Гормоны:

#     '[INS]': r'$\alpha$ * J_{carb} +$\beta$ * J_{fat} + $\gamma$ * J_{prot} - $CL_{INS}$ * [INS]',

#     # Добавим две новые функции гормонов (их надо обсудить и исправить):

#    '[GLN]': r'$\lambda$ * (1/[Glu]_{ef}) - $CL_{GLN}$ * [GLN]',
#    '[CAM]': r'$\sigma$ * 60 - $CL_{CAM}$ * [CAM]'
# #    '[CAM]': r'$\sigma$ * [Heart Rate] - $CL_{CAM}$ * [CAM]'

#     # Глюкагон [GLN] обратно зависим от концентрации [Glu]_{ef} (глюкозы в межклет жидкости).
#     # GLN Выделяется при [Glu]_{ef} < 4 mmol/l.

#     # Андреналин/норадреналин [CAM] можно отслеживать по пульсу.
#     # Если пульс выше возрастной нормы, значит, [CAM] повышен.

#     # Клиренс у всех трёх гормонов: полный - 5 минут, 50% - около 1 минуты. Падает экспоненциально.

# }

